In [1]:
import pandas as pd

In [2]:
director = ["철수","영희","장군"]
director = pd.Series(director,name="감독",index=[1,2,3])
director

1    철수
2    영희
3    장군
Name: 감독, dtype: object

In [3]:
sub = ["강희","동욱","재한"]
sub = pd.Series(sub,name="조감독",index=[1,2,3])
sub

1    강희
2    동욱
3    재한
Name: 조감독, dtype: object

In [4]:
df = pd.DataFrame({
    "감독" : director,
    "조감독" : sub})
df

   감독 조감독
1  철수  강희
2  영희  동욱
3  장군  재한

In [5]:
df["영화 제목"] = ["7번방의 선물","광해","서울의 봄"]
df

   감독 조감독    영화 제목
1  철수  강희  7번방의 선물
2  영희  동욱       광해
3  장군  재한    서울의 봄

In [6]:
new_data = {"감독":"준범","조감독":"혜성","영화 제목":"미이라"}
df = pd.concat([df,pd.DataFrame([new_data])],ignore_index=True)
df

   감독 조감독    영화 제목
0  철수  강희  7번방의 선물
1  영희  동욱       광해
2  장군  재한    서울의 봄
3  준범  혜성      미이라

In [7]:
df = pd.concat([df,pd.DataFrame([{"감독":"준섭","조감독":"태영","영화 제목":"내마그"}])],ignore_index=True)
df

   감독 조감독    영화 제목
0  철수  강희  7번방의 선물
1  영희  동욱       광해
2  장군  재한    서울의 봄
3  준범  혜성      미이라
4  준섭  태영      내마그

In [8]:
df.rename(columns = {"영화 제목":"영화"}, inplace = True)
df

   감독 조감독       영화
0  철수  강희  7번방의 선물
1  영희  동욱       광해
2  장군  재한    서울의 봄
3  준범  혜성      미이라
4  준섭  태영      내마그

In [9]:
df.rename(columns={"영화":"영화제목"},inplace = True)
df

   감독 조감독     영화제목
0  철수  강희  7번방의 선물
1  영희  동욱       광해
2  장군  재한    서울의 봄
3  준범  혜성      미이라
4  준섭  태영      내마그

In [14]:
df.loc[df["감독"]=="철수","영화제목"] = "배트맨"
df

   감독 조감독   영화제목
0  철수  강희    배트맨
1  영희  동욱     광해
2  장군  재한  서울의 봄
3  준범  혜성    미이라
4  준섭  태영    내마그

In [21]:
df.loc[df["감독"]=="철수","감독"]="윤진"
df.loc[df["감독"]=="영희","감독"]="원석"
df.loc[df["감독"]=="장군","감독"]="윤태"
df

   감독 조감독   영화제목
0  윤진  강희    배트맨
1  원석  동욱     광해
2  윤태  재한  서울의 봄
3  준범  혜성    미이라
4  준섭  태영    내마그

In [26]:
df.rename(index={0:"1번째",1:"2번째",2:"3번째",3:"4번째",4:"5번째"},inplace=True)
df

      감독 조감독   영화제목
첫번째   윤진  강희    배트맨
두번째   원석  동욱     광해
세번째   윤태  재한  서울의 봄
네번째   준범  혜성    미이라
다섯번째  준섭  태영    내마그